10/data/attachments/ebb5adf9b588d2ce.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:removeFriendRequest>
            <nif:username>soap_actions_e60064b1-13fa-444d-95f4-8724cdd29528</nif:username>
            <nif:friendToBeRemoved>Heidi_available_Actions_74378_0</nif:friendToBeRemoved>
        </nif:removeFriendRequest>
    </soapenv:Body>
</soapenv:Envelope>